[{"page": 1, "text": "SE SPECIAL FRANK M. WHITE\nINDIAN\nEDITION\nFLUID\nMECHANICS\nMc\nGraw\nHll 8TH EDITION IN SI UNITS\nEducation", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 2, "text": "Fluid Mechanics", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 4, "text": "Fluid Mechanics\nEighth Edition\nFrank M. White\nUniversity of Rhode Island", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 5, "text": "FLUID MECHANICS, EIGHTH EDITION\nPublished by McGraw-Hill Education, 2 Penn Plaza, New York, NY 10121. Copyright © 2016 by\nMcGraw-Hill Education. All rights reserved. Printed in the United States of America. Previous editions\n© 2011, 2008, and 2003. No part of this publication may be reproduced or distributed in any form or by\nany means, or stored in a database or retrieval system, without the prior written consent of McGraw-Hill\nEducation, including, but not limited to, in any network or other electronic storage or transmission, or\nbroadcast for distance learning.\nSome ancillaries, including electronic and print components, may not be available to customers outside the\nUnited States.\nThis book is printed on acid-free paper.\n1 2 3 4 5 6 7 8 9 0 DOC/DOC 1 0 9 8 7 6 5\nISBN 978-9-38-596549-4\nMHID 9-38-596549-2\nSenior Vice President, Products & Markets: Kurt L. Strand\nV ice President, General Manager, Products & Markets: Marty Lange\nVice President, Content Design & Delivery: K imberly Meriwether David\nManaging Director: T homas Timp\nBrand Manager: T homas Scaife\nDirector, Product Development: Rose Koos\nProduct Developer: Lorraine Bucze k\nMarketing Manager: N ick McFadden\nDirector, Content Design & Delivery: Linda Avenarius\nProgram Manager: L ora Neyens\nContent Project Manager: L isa Brufl odt\nContent Project Manager: T ammy Juran\nBuyer: S usan K. Culbertson\nContent Licensing Specialists: Deanna Dausener\nCover Image: Doug Sherman/Geofi le\nCompositor: Aptara®, Inc.\nP rinter: R. R. Donnelley\nAll credits appearing on page or at the end of the book are considered to be an extension of the copyright page.\nLibrary of Congress Cataloging-in-Publication Data\nWhite, Frank M.\nFluid mechanics/Frank M. White, University of Rhode Island.—Eighth edition.\npages cm\nIncludes index.\nISBN 978-9-38-596549-4 (alk. paper)—ISBN 9-38-596549-2 (alk. paper)\n1. Fluid mechanics. I. Title.\nTA357.W48 2016\n620.1’06—dc23\n2014034259\nThe Internet addresses listed in the text were accurate at the time of publication. The inclusion of a website\ndoes not indicate an endorsement by the authors or McGraw-Hill Education, and McGraw-Hill Education does\nnot guarantee the accuracy of the information presented at these sites.\nwww.mhhe.com", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 6, "text": "About the Author\nFrank M. White is Professor Emeritus of Mechanical and Ocean Engineering at the\nUniversity of Rhode Island. He studied at Georgia Tech and M.I.T. In 1966 he helped\nfound, at URI, the fi rst department of ocean engineering in the country. Known\nprimarily as a teacher and writer, he has received eight teaching awards and has\nwritten four textbooks on fl uid mechanics and heat transfer.\nFrom 1979 to 1990, he was editor-in-chief of the A SME Journal of Fluids\nEngineering and then served from 1991 to 1997 as chairman of the ASME Board of\nEditors and of the Publications Committee. He is a Fellow of ASME and in 1991\nreceived the ASME Fluids Engineering Award. He lives with his wife, Jeanne, in\nNarragansett, Rhode Island.\nv", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 7, "text": "To Jeanne", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 8, "text": "Contents\nPreface x i 2.9 Pressure Distribution in Rigid-Body Motion 91\n2.10 Pressure Measurement 99\nChapter 1 Summary 103\nIntroduction 3 Problems 103\nWord Problems 126\n1.1 Preliminary Remarks 3\nFundamentals of Engineering Exam Problems 126\n1.2 The Concept of a Fluid 4\nComprehensive Problems 127\n1.3 The Fluid as a Continuum 6\nDesign Projects 129\n1.4 Dimensions and Units 7\nReferences 130\n1.5 Properties of the Velocity Field 15\n1.6 Thermodynamic Properties of a Fluid 15\nChapter 3\n1.7 Viscosity and Other Secondary Properties 23\nIntegral Relations for a Control Volume 133\n1.8 Basic Flow Analysis Techniques 39\n1.9 Flow Patterns: Streamlines, Streaklines, and Pathlines 39 3.1 Basic Physical Laws of Fluid Mechanics 133\n1.10 The Fundamentals of Engineering (FE) Examination 43 3.2 The Reynolds Transport Theorem 137\n1.11 The History of Fluid Mechanics 43 3.3 Conservation of Mass 144\nSummary 44 3.4 The Linear Momentum Equation 149\nProblems 45 3.5 Frictionless Flow: The Bernoulli Equation 163\nFundamentals of Engineering Exam Problems 52 3.6 The Angular Momentum Theorem 172\nComprehensive Problems 53 3.7 The Energy Equation 178\nReferences 56 Summary 189\nProblems 189\nChapter 2 Word Problems 216\nPressure Distribution in a Fluid 59 Fundamentals of Engineering Exam Problems 217\nComprehensive Problems 218\n2.1 Pressure and Pressure Gradient 59\nDesign Project 219\n2.2 Equilibrium of a Fluid Element 61\nReferences 219\n2.3 Hydrostatic Pressure Distributions 62\n2.4 Application to Manometry 69\nChapter 4\n2.5 Hydrostatic Forces on Plane Surfaces 72\nDifferential Relations for Fluid Flow 221\n2.6 Hydrostatic Forces on Curved Surfaces 80\n2.7 Hydrostatic Forces in Layered Fluids 83 4.1 The Acceleration Field of a Fluid 222\n2.8 Buoyancy and Stability 85 4.2 The Differential Equation of Mass Conservation 224\nvii", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 9, "text": "viii Contents\n4.3 The Differential Equation of Linear Momentum 230 6.10 Multiple-Pipe Systems 389\n4.4 The Differential Equation of Angular Momentum 237 6.11 Experimental Duct Flows: Diffuser Performance 395\n4.5 The Differential Equation of Energy 238 6.12 Fluid Meters 400\n4.6 Boundary Conditions for the Basic Equations 241 Summary 421\n4.7 The Stream Function 246 Problems 422\n4.8 Vorticity and Irrotationality 253 Word Problems 440\n4.9 Frictionless Irrotational Flows 255 Fundamentals of Engineering Exam Problems 441\n4.10 Some Illustrative Incompressible Viscous Flows 261 Comprehensive Problems 442\nSummary 269 Design Projects 444\nProblems 269 References 444\nWord Problems 280\nFundamentals of Engineering Exam Problems 281\nChapter 7\nComprehensive Problems 281\nFlow Past Immersed Bodies 449\nReferences 282\n7.1 Reynolds Number and Geometry Effects 449\n7.2 Momentum Integral Estimates 453\nChapter 5\n7.3 The Boundary Layer Equations 456\nDimensional Analysis and Similarity 285\n7.4 The Flat-Plate Boundary Layer 459\n5.1 Introduction 285 7.5 Boundary Layers with Pressure Gradient 468\n5.2 The Principle of Dimensional Homogeneity 288 7.6 Experimental External Flows 474\n5.3 The Pi Theorem 294 Summary 501\n5.4 Nondimensionalization of the Basic Equations 304 Problems 502\n5.5 Modeling and Similarity 313 Word Problems 515\nSummary 325 Fundamentals of Engineering Exam Problems 515\nProblems 325 Comprehensive Problems 516\nWord Problems 333 Design Project 517\nFundamentals of Engineering Exam Problems 334 References 517\nComprehensive Problems 334\nDesign Projects 335\nChapter 8\nReferences 336\nPotential Flow and Computational Fluid Dynamics 521\n8.1 Introduction and Review 521\nChapter 6\n8.2 Elementary Plane Flow Solutions 524\nViscous Flow in Ducts 339\n8.3 Superposition of Plane Flow Solutions 531\n6.1 Reynolds Number Regimes 339 8.4 Plane Flow Past Closed-Body Shapes 537\n6.2 Internal versus External Viscous Flows 344 8.5 Other Plane Potential Flows 547\n6.3 Head Loss—The Friction Factor 347 8.6 Images 551\n6.4 Laminar Fully Developed Pipe Flow 349 8.7 Airfoil Theory 554\n6.5 Turbulence Modeling 351 8.8 Axisymmetric Potential Flow 562\n6.6 Turbulent Pipe Flow 358 8.9 Numerical Analysis 568\n6.7 Four Types of Pipe Flow Problems 366 Summary 577\n6.8 Flow in Noncircular Ducts 371 Problems 577\n6.9 Minor or Local Losses in Pipe Systems 380 Word Problems 588", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 10, "text": "Contents ix\nComprehensive Problems 588 Problems 724\nDesign Projects 589 Word Problems 736\nReferences 590 Fundamentals of Engineering Exam Problems 736\nComprehensive Problems 736\nDesign Projects 738\nChapter 9\nReferences 738\nCompressible Flow 593\n9.1 Introduction: Review of Thermodynamics 593\nChapter 11\n9.2 The Speed of Sound 598\nTurbomachinery 741\n9.3 Adiabatic and Isentropic Steady Flow 600\n9.4 Isentropic Flow with Area Changes 606 11.1 Introduction and Classifi cation 741\n9.5 The Normal Shock Wave 613 11.2 The Centrifugal Pump 744\n9.6 Operation of Converging and Diverging Nozzles 621 11.3 Pump Performance Curves and Similarity Rules 750\n9.7 Compressible Duct Flow with Friction 626 11.4 Mixed- and Axial-Flow Pumps: The Specifi c Speed 760\n9.8 Frictionless Duct Flow with Heat Transfer 637 11.5 Matching Pumps to System Characteristics 767\n9.9 Mach Waves and Oblique Shock Waves 642 11.6 Turbines 775\n9.10 Prandtl-Meyer Expansion Waves 652 Summary 789\nSummary 664 Problems 791\nProblems 665 Word Problems 804\nWord Problems 678 Comprehensive Problems 804\nFundamentals of Engineering Exam Problems 678 Design Project 806\nComprehensive Problems 679 References 806\nDesign Projects 680\nReferences 681 Appendix A Physical Properties of Fluids 808\nAppendix B Compressible Flow Tables 813\nChapter 10\nOpen-Channel Flow 683 Appendix C Conversion Factors 820\n10.1 Introduction 683\nAppendix D Equations of Motion in Cylindrical Coordinates 822\n10.2 Uniform Flow; The Chézy Formula 689\n10.3 Effi cient Uniform-Flow Channels 695\nAppendix E Estimating Uncertainty in Experimental Data 824\n10.4 Specifi c Energy; Critical Depth 697\n10.5 The Hydraulic Jump 704\nAnswers to Selected Problems 826\n10.6 Gradually Varied Flow 708\n10.7 Flow Measurement and Control by Weirs 716 Index 833\nSummary 723", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 12, "text": "Preface\nGeneral Approach The eighth edition of Fluid Mechanics sees some additions and deletions but no\nphilosophical change. The basic outline of eleven chapters, plus appendices, remains\nthe same. The triad of integral, differential, and experimental approaches is retained.\nMany problem exercises, and some fully worked examples, have been changed. The\ninformal, student-oriented style is retained. A number of new photographs and fi gures\nhave been added. Many new references have been added, for a total of 445. The writer\nis a fi rm believer in “further reading,” especially in the postgraduate years.\nLearning Tools The total number of problem exercises continues to increase, from 1089 in the fi rst\nedition, to 1683 in this eighth edition. There are approximately 20 new problems in\neach chapter. Most of these are basic end-of-chapter problems, classifi ed according\nto topic. There are also Word Problems, multiple-choice Fundamentals of Engineering\nProblems, Comprehensive Problems, and Design Projects. The appendix lists approx-\nimately 700 Answers to Selected Problems.\nThe example problems are structured in the text to follow the sequence of recom-\nmended steps outlined in Section 1.7.\nMost of the problems in this text can be solved with a hand calculator. Some can\neven be simply explained in words. A few problems, especially in Chapters 6, 9, and\n10, involve solving complicated algebraic expressions, laborious for a hand calculator.\nCheck to see if your institution has a license for equation-solving software. Here the\nwriter solves complicated example problems by using the iterative power of Microsoft\nOffi ce Excel, as illustrated, for example, in Example 6.5. For further use in your work,\nExcel also contains several hundred special mathematical functions for engineering\nand statistics. Another benefi t: Excel is free.\nContent Changes There are some revisions in each chapter.\nChapter 1 has been substantially revised. The pre-reviewers felt, correctly, that it was\ntoo long, too detailed, and at too high a level for an introduction. Former Section 1.2,\nHistory of Fluid Mechanics, has been shortened and moved to the end of the chapter.\nFormer Section 1.3, Problem-Solving Techniques, has been moved to appear just\nbefore Example 1.7, where these techniques are fi rst used. Eulerian and Lagrangian\ndescriptions have been moved to Chapter 4. A temperature-entropy chart for steam\nxi", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 13, "text": "xii Preface\nhas been added, to illustrate when steam can and cannot be approximated as an ideal\ngas. Former Section 1.11, Flow Patterns, has been cut sharply and mostly moved to\nChapter 4. Former Section 1.13, Uncertainty in Experimental Data, has been moved\nto a new Appendix E. No one teaches “uncertainty” in introductory fl uid mechanics,\nbut the writer feels it is extremely important in all engineering fi elds involving exper-\nimental or numerical data.\nChapter 2 adds a brief discussion of the fact that pressure is a thermodynamic\nproperty, not a force, has no direction, and is not a vector. The arrow, on a surface\nforce caused by pressure, causes confusion for beginning students. The subsection of\nSection 2.8 entitled Stability Related to Waterline Area has been shortened to omit\nthe complicated derivations. The fi nal metacenter formula is retained; the writer does\nnot think it is suffi cient just to show a sketch of a fl oating body falling over. This\nbook should have reference value.\nChapter 3 was substantially revised in the last edition, especially by moving\nBernoulli’s equation to follow the linear momentum section. This time the only\nchanges are improvements in the example problems.\nChapter 4 now discusses the Eulerian and Lagrangian systems, moved from\nChapter 1. The no-slip and no-temperature-jump boundary conditions are added, with\nproblem assignments.\nChapter 5 explains a bit more about drag force before assigning dimensional\na nalysis problems. It retains Ipsen’s method as an interesting alternative which, of\ncourse, may be skipped by pi theorem adherents.\nChapter 6 downplays the Moody chart a bit, suggesting that students use either\niteration or Excel. For rough walls, the chart is awkward to read, although it gives an\napproximation for use in iteration. The author’s fancy rearrangement of pi groups to\nsolve type 2, fl ow rate, and type 3, pipe diameter problems is removed from the main\ntext and assigned as problems. For noncircular ducts, the hydraulic radius is omitted\nand moved to Chapter 10. There is a new Example 6.11, which solves for pipe\ndiameter and determines if Schedule 40 pipe is strong enough. A general discussion\nof pipe strength is added. There is a new subsection on laminar-fl ow minor losses,\nappropriate for micro- and nano-tube fl ows.\nChapter 7 has more treatment of vehicle drag and rolling resistance, and a rolling\nresistance coeffi cient is defi ned. There is additional discussion of the Kline-Fogelman\nairfoil, extremely popular now for model aircraft.\nChapter 8 has backed off from extensive discussion of CFD methods, as proposed by\nthe pre-reviewers. Only a few CFD examples are now given. The inviscid duct-expansion\nexample and the implicit boundary layer method are now omitted, but the explicit method\nis retained. For airfoil theory, the writer considers thin-airfoil vortex-sheet theory to be\nobsolete and has deleted it.\nChapter 9 now has a better discussion of the normal shock wave. New supersonic\nwave photographs are added. The “new trend in aeronautics” is the Air Force X-35\nJoint Strike Fighter.\nChapter 10 improves the defi nition of normal depth of a channel. There is a new\nsubsection on the water-channel compressible fl ow analogy, and problems are assigned\nto fi nd the oblique wave angle for supercritical water fl ow past a wedge.\nChapter 11 greatly expands the discussion of wind turbines, with examples and\nproblems taken from the author’s own experience.", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 14, "text": "Preface xiii\nAppendices B and D are unchanged. Appendix A adds a list of liquid kinematic\nviscosities to Table A.4. A few more conversion factors are added to Appendix C.\nThere is a new Appendix E, Estimating Uncertainty in Experimental Data, which was\nmoved from its inappropriate position in Chapter 1. The writer believes that “uncer-\ntainty” is vital to reporting measurements and always insisted upon it when he was\nan engineering journal editor.\nAdaptive Online Learning Tools M cGraw-Hill LearnSmart ® is available as a standalone product or an integrated\nfeature of McGraw-Hill Connect Engineering. It is an adaptive learning system\ndesigned to help students learn faster, study more effi ciently, and retain more knowl-\nedge for greater success. LearnSmart assesses a student’s knowledge of course content\nthrough a series of adaptive questions. It pi n points concepts the student does not\nunderstand and maps out a personalized study plan for suc c ess. This innovative study\ntool also has features that allow instructors to see exactly what stu d ents have accom-\nplished and a built-in assessment tool for graded assignments. Visit the follow i ng site\nfor a demonstration: www.LearnSmartAdvantage.com\nPowered by the intelligent and adaptive LearnSmart engine, S martBook ™ is the\nfi rst and only continuously adaptive reading experience available today. Distin-\nguishing what students know from what they don’t, and honing in on con c epts they\nare most likely to forget, S martBook personalizes the reading experience for each\nstudent. Reading is no longer a passive and linear experience but an engaging and\ndynamic one, where students are more likely to master and retain important\nco n cepts, coming to class better prepared. SmartBook includes powerful reports\nthat identify sp e cifi c topics and learning objectives students need to study. w ww.\nLearnSmartAdvantage.com\nM cGraw-Hill’s Connect Engineering offers a number of powerful tools and features\nto make man a ging assignments easier, so you can spend more time teaching. Students\nengage with their coursework anytime from anywhere in a personalized way, making\nthe learning process more ac c essible and effi cient. Connect Engineering optimizes\nyour time and energy, enabling you to focus on course content and learning outcomes,\nteaching, and student learning.\nOnline Supplements A number of supplements are available to instructors at McGraw-Hill’s Connect Engi-\nneering®. Instructors may obtain the text images in PowerPoint format and the full\nSolutions Manual in PDF format. The sol u tions manual provides complete and detailed\nsolutions, including problem statements and artwork, to the end-of-chapter problems.\nInstructors can also obtain access to the Complete Online Solutions Manual O r ganiza-\ntion System (C.O.S.M.O.S.) for Fluid Mechanics, 8 th edition. Instructors can use\nC.O.S.M.O.S. to create exams and assignments, to create custom content, and to edit\nsupplied problems and solutions.", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 15, "text": "Acknowledgments\nA s usual, so many people have helped me that I may fail to list them all. Material help,\nin the form of photos, articles, and problems, came from Scott Larwood of the Univer-\nsity of the Pacifi c; Sukanta Dash of the Indian Institute of Technology at Kharagpur;\nMark Coffey of the Colorado School of Mines; Mac Stevens of Oregon State University;\nStephen Carrington of Malvern Instruments; Carla Cioffi of NASA; Lisa Lee and Robert\nPacquette of the Rhode Island Department of Environmental Management; Vanessa\nBlakeley and Samuel Schweighart of Terrafugia Inc.; Beric Skews of the University of\nthe Witwatersrand, South Africa; Kelly Irene Knorr and John Merrill of the School of\nOceanography at the University of Rhode Island; Adam Rein of Altaeros Energies Inc.;\nDasari Abhinav of Anna University, India; Kris Allen of Transcanada Corporation;\nBruce Findlayson of the University of Washington; Wendy Koch of USA Today;\nLiz Boardman of the South County Independent; Beth Darchi and Colin McAteer of\nthe American Society of Mechanical Engineers; Catherine Hines of the William Beebe\nWeb Site; Laura Garrison of York College of Pennsylvania.\nThe following pre-reviewers gave many excellent suggestions for improving the\nmanuscript: Steve Baker, Naval Postgraduate School; Suresh Aggarwal, University\nof Illinois at Chicago; Edgar Caraballo, Miami University; Chang-Hwan Choi, S tevens\nInstitute of Technology; Drazen Fabris, Santa Clara University; James Liburdy,\nOregon State University; Daniel Maynes, Brigham Young University; Santosh Sahu,\nIndian Institute of Technology Indore; Brian Savilonis, Worcester Polytechnic I nstitute;\nEric Savory, University of Western Ontario; Rick Sellens, Queen’s University; G ordon\nStubley, University of Waterloo.\nMany others have supported me, throughout my revision efforts, with comments and\nsuggestions: Gordon Holloway of the University of New Brunswick; David Taggart,\nDonna Meyer, Arun Shukla, and Richard Lessmann of the University of Rhode Island;\nDebendra K. Das of the University of Alaska–Fairbanks; Elizabeth Kenyon of Math-\nworks; Deborah V. Pence of Oregon State University; Sheldon Green of the University\nof British Columbia; Elena Bingham of the DuPont Corporation; Jane Bates of Broad\nRock School; Kim Mather of West Kingston School; Nancy Dreier of Curtiss Corner\nSchool; Richard Kline, co-inventor of the Kline-Fogelman airfoil.\nThe McGraw-Hill staff was, as usual, very helpful. Thanks are due to Bill S tenquist,\nKatherine Neubauer, Lorraine Buczek, Samantha Donisi-Hamm, Raghu Srinivasan,\nTammy Juran, Thomas Scaife, and Lisa Brufl odt.\nFinally, I am thankful for the continuing support of my family, especially Jeanne,\nwho remains in my heart, and my sister Sally White GNSH, my dog Jack, and my\nxiv cats Cole and Kerry.", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 16, "text": "Fluid Mechanics", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 17, "text": "Falls on the Nesowadnehunk Stream in Baxter State Park, Maine, which is the northern terminus\nof the Appalachian Trail. Such fl ows, open to the atmosphere, are driven simply by gravity and\ndo not depend much upon fl uid properties such as density and viscosity. They are discussed later\nin Chap. 10. To the writer, one of the joys of fl uid mechanics is that visualization of a fl uid-fl ow\nprocess is simple and beautiful [Photo Credit: Design Pics/Natural Selection Robert Cable].\n2", "chapter": {"chapter_id": 0, "chapter_title": "Preface"}}, {"page": 18, "text": "Chapter 1\nIntroduction\n1.1 Preliminary Remarks Fluid mechanics is the study of fl uids either in motion (fl uid dynamics ) or at rest (fl uid\nstatics ). Both gases and liquids are classifi ed as fl uids, and the number of fl uid engi-\nneering applications is enormous: breathing, blood fl ow, swimming, pumps, fans,\nturbines, airplanes, ships, rivers, windmills, pipes, missiles, icebergs, engines, fi lters,\njets, and sprinklers, to name a few. When you think about it, almost everything on\nthis planet either is a fl uid or moves within or near a fl uid.\nThe essence of the subject of fl uid fl ow is a judicious compromise between theory\nand experiment. Since fl uid fl ow is a branch of mechanics, it satisfi es a set of well-\ndocumented basic laws, and thus a great deal of theoretical treatment is available. However,\nthe theory is often frustrating because it applies mainly to idealized situations, which\nmay be invalid in practical problems. The two chief obstacles to a workable theory are\ngeometry and viscosity. The basic equations of fl uid motion (Chap. 4) are too diffi cult\nto enable the analyst to attack arbitrary geometric confi gurations. Thus most textbooks\nconcentrate on fl at plates, circular pipes, and other easy geometries. It is possible to\napply n umerical computer techniques to complex geometries, and specialized textbooks\nare now a vailable to explain the new c omputational fl uid dynamics (CFD) a pproximations\nand methods [1–4].1 This book will present many theoretical results while keeping their\nlimitations in mind.\nThe second obstacle to a workable theory is the action of viscosity, which can be\nneglected only in certain idealized fl ows (Chap. 8). First, viscosity increases the dif-\nfi culty of the basic equations, although the boundary-layer approximation found by\nLudwig Prandtl in 1904 (Chap. 7) has greatly simplifi ed viscous-fl ow analyses. Second,\nviscosity has a destabilizing effect on all fl uids, giving rise, at frustratingly small\nvelocities, to a disorderly, random phenomenon called turbulence. The theory of tur-\nbulent fl ow is crude and heavily backed up by experiment (Chap. 6), yet it can be quite\nserviceable as an engineering estimate. This textbook only introduces the standard\nexperimental correlations for turbulent time-mean fl ow. Meanwhile, there are advanced\ntexts on both time-mean t urbulence and turbulence modeling [5, 6] and on the newer,\ncomputer-intensive direct numerical simulation (DNS) of fl uctuating turbulence [7, 8].\n1 Numbered references appear at the end of each chapter.\n3", "chapter": {"chapter_id": 1, "chapter_title": ""}}, {"page": 19, "text": "4 Chapter 1 Introduction\nThus there is theory available for fl uid fl ow problems, but in all cases it should be\nbacked up by experiment. Often the experimental data provide the main source of\ninformation about specifi c fl ows, such as the drag and lift of immersed bodies\n(Chap. 7). Fortunately, fl uid mechanics is a highly visual subject, with good instru-\nmentation [9–11], and the use of dimensional analysis and modeling concepts (Chap. 5)\nis widespread. Thus experimentation provides a natural and easy complement to the\ntheory. You should keep in mind that theory and experiment should go hand in hand\nin all studies of fl uid mechanics.\n1.2 The Concept of a Fluid F rom the point of view of fl uid mechanics, all matter consists of only two states, fl uid\nand solid. The difference between the two is perfectly obvious to the layperson, and\nit is an interesting exercise to ask a layperson to put this difference into words. The\ntechnical distinction lies with the reaction of the two to an applied shear or tangential\nstress. A solid can resist a shear stress by a static defl ection; a fl uid ca n not . Any\nshear stress applied to a fl uid, no matter how small, will result in motion of that fl uid.\nThe fl uid moves and deforms continuously as long as the shear stress is applied. As\na corollary, we can say that a fl uid at rest must be in a state of zero shear stress, a\nstate often called the hydrostatic stress condition in structural analysis. In this condi-\ntion, Mohr’s circle for stress reduces to a point, and there is no shear stress on any\nplane cut through the element under stress.\nGiven this defi nition of a fl uid, every layperson also knows that there are two\nclasses of fl uids, li q uids andg ases. Again the distinction is a technical one concerning\nthe effect of cohesive forces. A liquid, being composed of relatively close-packed\nmolecules with strong cohesive forces, tends to retain its volume and will form a free\nsurface in a gravitational fi eld if unconfi ned from above. Free-surface fl ows are domi-\nnated by gravitational effects and are studied in Chaps. 5 and 10. Since gas molecules\nare widely spaced with negligible cohesive forces, a gas is free to expand until it\nencounters confi ning walls. A gas has no defi nite volume, and when left to itself\nwithout confi nement, a gas forms an atmosphere that is essentially hydrostatic. The\nhydrostatic behavior of liquids and gases is taken up in Chap. 2. Gases cannot form\na free surface, and thus gas fl ows are rarely concerned with gravitational effects other\nthan buoyancy.\nFigure 1.1 illustrates a solid block resting on a rigid plane and stressed by its own\nweight. The solid sags into a static defl ection, shown as a highly exaggerated dashed\nline, resisting shear without fl ow. A free-body diagram of element A on the side of\nthe block shows that there is shear in the block along a plane cut at an angle θ\nthrough A. Since the block sides are unsupported, element A has zero stress on the\nleft and right sides and compression stress σ 5 2 p on the top and bottom. Mohr’s\ncircle does not reduce to a point, and there is nonzero shear stress in the block.\nBy contrast, the liquid and gas at rest in Fig. 1.1 require the supporting walls in\norder to eliminate shear stress. The walls exert a compression stress of 2 p and reduce\nMohr’s circle to a point with zero shear everywhere—that is, the hydrostatic c ondition.\nThe liquid retains its volume and forms a free surface in the container. If the walls\nare removed, shear develops in the liquid and a big splash results. If the c ontainer\nis tilted, shear again develops, waves form, and the free surface seeks a horizontal\nconfi guration, pouring out over the lip if necessary. Meanwhile, the gas is unrestrained", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 20, "text": "1.2 The Concept of a Fluid 5\nStatic Free\ndeflection surface\nA A A\nSolid Liquid Gas\n(a) (c)\nσ p\n1\nθ θ\nτ\n0 1 p τ = 0\nA 0 A p\n– σ = p – σ = p\nτ τ\nFig. 1. 1 A solid at rest can resist\n(1)\nshear. ( a ) Static defl ection of the\nHydrostatic\nsolid; ( b ) equilibrium and Mohr’s\ncondition\n2θ\ncircle for solid element A . A fl uid σ σ\n– p – p\ncannot resist shear. ( c ) Containing\nwalls are needed; ( d ) equilibrium\nand Mohr’s circle for fl uid\nelement A . (b) (d)\nand expands out of the container, fi lling all available space. Element A in the gas is\nalso hydrostatic and exerts a compression stress 2 p on the walls.\nIn the previous discussion, clear decisions could be made about solids, liquids, and\ngases. Most engineering fl uid mechanics problems deal with these clear cases—that\nis, the common liquids, such as water, oil, mercury, gasoline, and alcohol, and the\ncommon gases, such as air, helium, hydrogen, and steam, in their common tempera-\nture and pressure ranges. There are many borderline cases, however, of which you\nshould be aware. Some apparently “solid” substances such as asphalt and lead resist\nshear stress for short periods but actually deform slowly and exhibit defi nite fl uid\nbehavior over long periods. Other substances, notably colloid and slurry mixtures,\nresist small shear stresses but “yield” at large stress and begin to fl ow as fl uids do.\nSpecialized textbooks are devoted to this study of more general deformation and fl ow, a\nfi eld called r heology [16]. Also, liquids and gases can coexist in two-phase mixtures,\nsuch as steam–water mixtures or water with entrapped air bubbles. Specialized text-\nbooks present the analysis of such multiphase fl ows [17]. Finally, in some situations\nthe distinction between a liquid and a gas blurs. This is the case at temperatures and", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 21, "text": "6 Chapter 1 Introduction\npressures above the so-called critical point of a substance, where only a single phase\nexists, primarily resembling a gas. As pressure increases far above the critical point,\nthe gaslike substance becomes so dense that there is some resemblance to a liquid, and the\nusual thermodynamic approximations like the perfect-gas law become inaccurate. The critical\ntemperature and pressure of water are T 5 647 K and p 5 219 atm (atmosphere)2\nc c\nso that typical problems involving water and steam are below the critical point. Air,\nbeing a mixture of gases, has no distinct critical point, but its principal component,\nnitrogen, has T 5 126 K and p 5 34 atm. Thus typical problems involving air are\nc c\nin the range of high temperature and low pressure where air is distinctly and defi nitely\na gas. This text will be concerned solely with clearly identifi able liquids and gases,\nand the borderline cases just discussed will be beyond our scope.\n1.3 The Fluid as a Continuum We have already used technical terms such as fl uid pressure and density without a\nrigorous discussion of their defi nition. As far as we know, fl uids are aggregations of\nmolecules, widely spaced for a gas, closely spaced for a liquid. The distance between\nmolecules is very large compared with the molecular diameter. The molecules are not\nfi xed in a lattice but move about freely relative to each other. Thus fl uid density, or\nmass per unit volume, has no precise meaning because the number of molecules\noccupying a given volume continually changes. This effect becomes unimportant if\nthe unit volume is large compared with, say, the cube of the molecular spacing, when\nthe number of molecules within the volume will remain nearly constant in spite of the\nenormous interchange of particles across the boundaries. If, however, the chosen unit\nvolume is too large, there could be a noticeable variation in the bulk aggregation of\nthe particles. This situation is illustrated in Fig. 1.2, where the “density” as calculated\nfrom molecular mass δ m within a given volume δ 9 is plotted versus the size of the\nunit volume. There is a limiting volume δ 9* below which molecular variations may\nbe important and above which aggregate variations may be important. The d ensity ρ of\na fl uid is best defi ned as\nδm\nρ 5 lim (1.1)\nδ 9Sδ 9* δ 9\nρ Microscopic\nElemental uncertainty\nvolume ρ = 1000 kg/m3\nMacroscopic\nρ = 1100 uncertainty\nδυ\n1200\nρ = 1200\nFig. 1. 2 The limit defi nition of\ncontinuum fl uid density: (a ) an ρ = 1300 δ9\nelemental volume in a fl uid region 0 δ9* ≈ 10–9 mm3\nof variable continuum density; Region containing fluid\n( b ) calculated density versus size\nof the elemental volume. (a) (b)\n2 One atmosphere equals 2116 lbf/ft2 5 101,300 Pa.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 22, "text": "1.4 Dimensions and Units 7\nTh e limiting volume δ 9* is about 102 9 mm3 for all liquids and for gases at atmo-\nspheric pressure. For example, 102 9 mm 3 of air at standard conditions contains\napproximately 3 3 10 7 molecules, which is suffi cient to defi ne a nearly constant density\naccording to Eq. (1.1). Most engineering problems are concerned with physical dimensions\nmuch larger than this limiting volume, so that density is essentially a point function\nand fl uid properties can be thought of as varying continually in space, as sketched in\nFig. 1.2a. Such a fl uid is called a continuum, which simply means that its variation in\nproperties is so smooth that differential calculus can be used to analyze the substance.\nWe shall assume that continuum calculus is valid for all the analyses in this book.\nAgain there are borderline cases for gases at such low pressures that molecular spacing\nand mean free path 3 are comparable to, or larger than, the physical size of the system.\nThis requires that the continuum approximation be dropped in favor of a molecular\ntheory of rarefi ed gas fl ow [18]. In principle, all fl uid mechanics problems can be\nattacked from the molecular viewpoint, but no such attempt will be made here. Note\nthat the use of continuum calculus does not preclude the possibility of discontinuous\njumps in fl uid properties across a free surface or fl uid interface or across a shock\nwave in a compressible fl uid (Chap. 9). Our calculus in analyzing fl uid fl ow must be\nfl exible enough to handle discontinuous boundary conditions.\n1.4 Dimensions and Units A dimension is the measure by which a physical variable is expressed quantitatively.\nA u nit is a particular way of attaching a number to the quantitative dimension. Thus\nlength is a dimension associated with such variables as distance, displacement, width,\ndefl ection, and height, while centimeters and inches are both numerical units for\nexpressing length. Dimension is a powerful concept about which a splendid tool called\ndimensional analysis has been developed (Chap. 5), while units are the numerical\nquantity that the customer wants as the fi nal answer.\nIn 1872 an international meeting in France proposed a treaty called the Metric\nConvention, which was signed in 1875 by 17 countries including the United States.\nIt was an improvement over British systems because its use of base 10 is the founda-\ntion of our number system, learned from childhood by all. Problems still remained\nbecause even the metric countries differed in their use of kiloponds instead of dynes\nor newtons, kilograms instead of grams, or calories instead of joules. To standardize\nthe metric system, a General Conference of Weights and Measures, attended in 1960\nby 40 countries, proposed the International System of Units (SI). We are now under-\ngoing a painful period of transition to SI, an adjustment that may take many more\nyears to complete. The professional societies have led the way. Since July 1, 1974,\nSI units have been required by all papers published by the American Society of\nMechanical Engineers, and there is a textbook explaining the SI [19]. The present text\nwill use SI units together with British gravitational (BG) units.\nPrimary Dimensions In fl uid mechanics there are only four p rimary dimensions from which all other dimen-\nsions can be derived: mass, length, time, and temperature. 4 These dimensions and\n3 The mean distance traveled by molecules between collisions (see Prob. P1.5).\n4 If electromagnetic effects are important, a fi fth primary dimension must be included, electric current\n{ I }, whose SI unit is the ampere (A).", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 23, "text": "8 Chapter 1 Introduction\nTable 1.1 Primary Dimensions in\nPrimary dimension SI unit BG unit Conversion factor\nSI and BG Systems\nMass {M} Kilogram (kg) Slug 1 slug 5 14.5939 kg\nLength {L} Meter (m) Foot (ft) 1 ft 5 0.3048 m\nTime {T} Second (s) Second (s) 1 s 5 1 s\nTemperature {Θ} Kelvin (K) Rankine (8R) 1 K 5 1.88R\ntheir units in both systems are given in Table 1.1. Note that the Kelvin unit uses no\ndegree symbol. The braces around a symbol like { M} mean “the dimension” of mass.\nAll other variables in fl uid mechanics can be expressed in terms of { M }, { L }, { T },\nand { Θ} . For example, acceleration has the dimensions {L T 2 2} . The most crucial of\nthese secondary dimensions is force, which is directly related to mass, length, and\ntime by Newton’s second law. Force equals the time rate of change of momentum or,\nfor constant mass,\nF5ma (1.2)\nFrom this we see that, dimensionally, {F } 5 { MLT 2 2 }.\nThe International System (SI) The use of a constant of proportionality in Newton’s law, Eq. (1.2), is avoided\nby defi ning the force unit exactly in terms of the other basic units. In the SI sys-\ntem, the basic units are newtons {F } , kilograms {M } , meters {L } , and seconds\n{ T }. We defi ne\n#\n1 newton of force51 N 51 kg 1 m/s2\nThe newton is a relatively small force, about the weight of an apple (0.225 lbf ). In\naddition, the basic unit of temperature {®} in the SI system is the degree Kelvin, K.\nUse of these SI units (N, kg, m, s, K) will require no conversion factors in our\nequations.\nThe British Gravitational (BG) I n the BG system also, a constant of proportionality in Eq. (1.2) is avoided by defi n-\nSystem ing the force unit exactly in terms of the other basic units. In the BG system, the\nbasic units are pound-force { F }, slugs { M }, feet { L }, and seconds { T }. We defi ne\n#\n1 pound of force51 lbf51 slug 1 ft/s2\nOne lbf < 4.4482 N and approximates the weight of four apples. We will use the\nabbreviation l bf for pound-force and lbm for pound-mass. The slug is a rather\nhefty mass, equal to 32.174 lbm. The basic unit of temperature {Θ } in the BG\nsystem is the degree Rankine, 8 R . Recall that a temperature difference 1 K 5 1.88 R.\nUse of these BG units (lbf, slug, ft, s, 8 R) will require no conversion factors in our\nequations.\nOther Unit Systems T here are other unit systems still in use. At least one needs no proportionality c onstant:\nthe CGS system (dyne, gram, cm, s, K). However, CGS units are too small for most\napplications (1 dyne 5 102 5 N) and will not be used here.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 24, "text": "1.4 Dimensions and Units 9\nTable 1.2 Secondary Dimensions\nSecondary dimension SI unit BG unit Conversion factor\nin Fluid Mechanics\nArea {L2} m2 ft2 1 m2 5 10.764 ft2\nVolume {L3} m3 ft3 1 m3 5 35.315 ft3\nVelocity {LT 21} m/s ft/s 1 ft/s 5 0.3048 m/s\nAcceleration {LT 22} m/s2 ft/s2 1 ft/s2 5 0.3048 m/s2\nPressure or stress {ML21T 22} Pa 5 N/m2 lbf/ft2 1 lbf/ft2 5 47.88 Pa\nAngular velocity {T 21} s21 s21 1 s21 5 1 s21\nEnergy, heat, work {ML2T 22} J 5 N ∙ m ft ∙ lbf 1 ft ∙ lbf 5 1.3558 J\nPower {ML2T 23} W 5 J/s ft ∙ lbf/s 1 ft ∙ lbf/s 5 1.3558 W\nDensity {ML23} kg/m3 slugs/ft3 1 slug/ft3 5 515.4 kg/m3\nViscosity {ML21T 21} kg/(m ∙ s) slugs/(ft ∙ s) 1 slug/(ft ∙ s) 5 47.88 kg/(m ∙ s)\nSpecifi c heat {L2T 22Q21} m2/(s2 ∙ K) ft2/(s2 ∙ 8R) 1 m2/(s2 ∙ K) 5 5.980 ft2/(s2 ∙ 8R)\nIn the USA, some still use the English Engineering system (lbf, lbm, ft, s, 8 R), where\nthe basic mass unit is the pound of mass . Newton’s law (1.2) must be rewritten:\n#\nma ft lbm\nF5 g c , where g c 532.174 lbf # s2 (1.3)\nThe constant of proportionality, g , has both dimensions and a numerical value not\nc\nequal to 1.0. The present text uses only the SI and BG systems and will not solve\nproblems or examples in the English Engineering system. Because Americans still\nuse them, a few problems in the text will be stated in truly awkward units: acres,\ngallons, ounces, or miles. Your assignment will be to convert these and solve in the\nSI or BG systems.\nThe Principle of In engineering and science, a ll equations must be dimensionally homogeneous, that\nDimensional Homogeneity is, each additive term in an equation must have the same dimensions. For example,\ntake Bernoulli’s incompressible equation, to be studied and used throughout this text:\n1\np1 ρV2 1ρgZ 5constant\n2\nE ach and every term in this equation must have dimensions of pressure {M L2 1 T 2 2 }. We\nwill examine the dimensional homogeneity of this equation in detail in Example 1.3.\nA list of some important secondary variables in fl uid mechanics, with dimensions\nderived as combinations of the four primary dimensions, is given in Table 1.2. A more\ncomplete list of conversion factors is given in App. C.\nEXAMPLE 1.1\nA body weighs 1000 lbf when exposed to a standard earth gravity g 5 32.174 ft/s2 . ( a ) What\nis its mass in kg? (b ) What will the weight of this body be in N if it is exposed to the\nmoon’s standard acceleration g 5 1.62 m/s2 ? ( c ) How fast will the body accelerate if a\nmoon\nnet force of 400 lbf is applied to it on the moon or on the earth?", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 25, "text": "10 Chapter 1 Introduction\nSolution\nWe need to fi nd the ( a ) mass; (b ) weight on the moon; and ( c ) acceleration of this body. This\nis a fairly simple example of conversion factors for differing unit systems. No property data is\nneeded. The example is too low-level for a sketch.\nPart (a) Newton’s law (1.2) holds with known weight and gravitational acceleration. Solve for m:\n1000 lbf\nF5W51000 lbf5mg5 (m)(32.174 ft/s2), or m5 531.08 slugs\n32.174 ft/s2\nConvert this to kilograms:\nm531.08 slugs5 (31.08 slugs)(14.5939 kg/slug) 5454 kg Ans .( a )\nPart (b) The mass of the body remains 454 kg regardless of its location. Equation (1.2) applies with a\nnew gravitational acceleration and hence a new weight:\nF5W 5mg 5 (454 kg)(1.62 m/s2) 5735 N5165 lbf Ans . ( b )\nmoon moon\nPart (c) T his part does not involve weight or gravity or location. It is simply an application of N ewton’s\nlaw with a known mass and known force:\nF5400 lbf5ma5 (31.08 slugs) a\nSolve for\n400 lbf ft m m\na5\n31.08 slugs\n512.87\ns2\na0.3048\nft\nb53.92\ns2\nA ns . ( c )\nComment (c): This acceleration would be the same on the earth or moon or anywhere.\nMany data in the literature are reported in inconvenient or arcane units suitable\nonly to some industry or specialty or country. The engineer should convert these data\nto the SI or BG system before using them. This requires the systematic application\nof conversion factors, as in the following example.\nEXAMPLE 1.2\nI ndustries involved in viscosity measurement [27, 29] continue to use the CGS system of\nunits, since centimeters and grams yield convenient numbers for many fl uids. The absolute\nviscosity (μ ) unit is the p oise, named after J. L. M. Poiseuille, a French physician who in\n1840 performed pioneering experiments on water fl ow in pipes; 1 poise 5 1 g/(cm-s). The\nkinematic viscosity (ν ) unit is the stokes, named after G. G. Stokes, a British physicist who\nin 1845 helped develop the basic partial differential equations of fl uid momentum; 1 stokes 5\n1 cm2 / s. Water at 20 8C has μ < 0.01 poise and also ν < 0.01 stokes. Express these results\nin ( a ) SI and ( b ) BG units.\nSolution\nPart (a) • Approach: Systematically change grams to kg or slugs and change centimeters to meters\nor feet.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 26, "text": "1.4 Dimensions and Units 11\n• Property values: Given μ 5 0.01 g/(cm-s) andν 5 0.01 cm2 /s.\n• Solution steps: (a) For conversion to SI units,\ng g(1 kg/1000 g) kg\nμ50.01 # 50.01 50.001 #\ncm s cm(0.01 m/cm)s m s\ncm2 cm2(0.01 m/cm)2 m2\nν50.01 50.01 50.000001 Ans. ( a )\ns s s\nPart (b) • For conversion to BG units\ng g(1 kg/1000 g)(1 slug/14.5939 kg) slug\nμ50.01 # 50.01 50.0000209 #\ncm s (0.01 m/cm)(1 ft/0.3048 m)s ft s\ncm2 cm2(0.01 m/cm)2(1 ft/0.3048 m)2 ft2\nν50.01 50.01 50.0000108 Ans. ( b )\ns s s\n• Comments: T his was a laborious conversion that could have been shortened by using\nthe direct viscosity conversion factors in App. C or the inside front cover. For example,\nμ 5 μ /47.88.\nBG SI\nWe repeat our advice: Faced with data in unusual units, convert them immediately\nto either SI or BG units because (1) it is more professional and (2) theoretical equa-\ntions in fl uid mechanics are dime n sionally consistent and require no further conversion\nfactors when these two fundamental unit systems are used, as the following example\nshows.\nEXAMPLE 1.3\nA useful theoretical equation for computing the relation between pressure, velocity, and\naltitude in a steady fl ow of a nearly inviscid, nearly incompressible fl uid with negligible\nheat transfer and shaft work5 is the Bernoulli relation, named after Daniel Bernoulli, who\npublished a hydrodynamics textbook in 1738:\np 5p11ρV21ρgZ (1)\n0 2\nwhere p 5 stagnation pressure\n0\np 5 pressure in moving fl uid\nV 5 velocity\nρ 5 density\nZ 5 altitude\ng 5 gravitational acceleration\n( a) Show that Eq. (1) satisfi es the principle of dimensional homogeneity, which states that all\nadditive terms in a physical equation must have the same dimensions. (b ) Show that consistent\nunits result without additional conversion factors in SI units. ( c ) Repeat ( b ) for BG units.\n5 That’s an awful lot of assumptions, which need further study in Chap. 3.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 27, "text": "12 Chapter 1 Introduction\nSolution\nPart (a) We can express Eq. (1) dimensionally, using braces, by entering the dimensions of each term\nfrom Table 1.2:\n5ML21T22655ML21T22615ML2365L2T22615ML2365LT 2265L6\n55ML 21T 226 for all terms A ns. ( a )\nPart (b) Enter the SI units for each quantity from Table 1.2:\n5N/m2655N/m2615kg/m365m2/s2615kg/m365m/s265m6\n55N/m2615kg/(m # s2)6\nThe right-hand side looks bad until we remember from Eq. (1.3) that 1 kg 5 1 N ∙ s2 /m.\n5kg/(m # s2)65 5N 5m # s # 2 s / 2 m 6 6 55N/m26 Ans. ( b )\nT hus all terms in Bernoulli’s equation will have units of pascals, or newtons per square\nmeter, when SI units are used. No conversion factors are needed, which is true of all theo-\nretical equations in fl uid mechanics.\nPart (c) Introducing BG units for each term, we have\n5lbf/ft2655lbf/ft2615slugs/ft365ft2/s2615slugs/ft365ft/s265ft6\n55lbf/ft2615slugs/(ft # s2)6\nBut, from Eq. (1.3), 1 slug 5 1 lbf ∙ s2 /ft, so that\n5slugs/(ft # s2)65 5lb 5f f t # # s s 2 2 / 6 ft6 55lbf/ft26 Ans. ( c )\nA ll terms have the unit of pounds-force per square foot. No conversion factors are needed\nin the BG system either.\nThere is still a tendency in English-speaking countries to use pound-force per\nsquare inch as a pressure unit because the numbers are more manageable. For exam-\nple, standard atmospheric pressure is 14.7 lbf/in 2 5 2116 lbf/ft2 5 101,300 Pa. The\npascal is a small unit because the newton is less than 1 lbf and a square meter is a\n4\nvery large area.\nConsistent Units Note that not only must all (fl uid) mechanics equations be dimensionally homoge-\nneous, one must also use c onsistent units; that is, each additive term must have\nthe same units. There is no trouble doing this with the SI and BG systems, as\nin Example 1.3, but woe unto those who try to mix colloquial English units. For\nexample, in Chap. 9, we often use the assumption of steady adiabatic compressible\ngas fl ow:\nh11V2 5constant\n2", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 28, "text": "1.4 Dimensions and Units 13\nwhere h is the fl uid enthalpy and V 2 /2 is its kinetic energy per unit mass. Colloquial\nthermodynamic tables might list h in units of British thermal units per pound mass\n(Btu/lb), whereas V is likely used in ft/s. It is completely erroneous to add Btu/lb to\nft 2 /s 2 . The proper unit for h in this case is ft ∙ lbf/slug, which is identical to ft2 /s 2 . The\nconversion factor is 1 Btu/lb < 25,040 ft2 /s2 5 25,040 ft ∙ lbf/slug.\nHomogeneous versus All theoretical equations in mechanics (and in other physical sciences) are d imensionally\nDimensionally Inconsistent homogen e ous; that is, each additive term in the equation has the same dimensions.\nEquations However, the reader should be warned that many empirical formulas in the engineering\nliterature, arising primarily from correlations of data, are dimensionally inconsistent.\nTheir units cannot be reconciled simply, and some terms may contain hidden vari-\nables. An example is the formula that pipe valve manufacturers cite for liquid volume\nfl ow rate Q (m3 /s) through a partially open valve:\n¢p 1/2\nQ 5C a b\nV SG\nwhere D p is the pressure drop across the valve and SG is the specifi c gravity of the\nliquid (the ratio of its density to that of water). The quantity C is the v alve fl ow\nV\ncoeffi cient, which manufacturers tabulate in their valve brochures. Since SG is\ndimensionless {1}, we see that this formula is totally inconsistent, with one side\nbeing a fl ow rate {L 3 /T } and the other being the square root of a pressure drop\nTable 1.3 Convenient Prefi xes { M1 /2 /L 1/2 T }. It follows that C must have dimensions, and rather odd ones at that:\nfor Engineering Units V\n{ L7 /2 /M 1/2 }. Nor is the resolution of this discrepancy clear, although one hint is that\nMultiplicative the values of C in the literature increase nearly as the square of the size of the\nV\nfactor Prefi x Symbol\nvalve. The presentation of experimental data in homogeneous form is the subject of\n1012 tera T dime n sional analysis (Chap. 5). There we shall learn that a homogeneous form for\n109 giga G the valve fl ow relation is\n106 mega M\n103 kilo k ¢p 1/2\n102 hecto h Q 5C A a b\nd opening ρ\n10 deka da\n1021 deci d\n1022 centi c where ρ is the liquid density and A the area of the valve opening. The d ischarge\n1023 milli m coeffi cient C d is dimensionless and changes only moderately with valve size. Please\n1026 micro μ believe—until we establish the fact in Chap. 5—that this latter is a much better for-\n1029 nano n mulation of the data.\n10212 pico p\nMeanwhile, we conclude that dimensionally inconsistent equations, though they\n10215 femto f\n10218 atto a occur in engineering practice, are misleading and vague and even dangerous, in the\nsense that they are often misused outside their range of applicability.\nConvenient Prefi xes in Engineering results often are too small or too large for the common units, with too\nPowers of 10 many zeros one way or the other. For example, to write p 5 114,000,000 Pa is long\nand awkward. Using the prefi x “M” to mean 10 6 , we convert this to a concise p 5\n114 MPa (megapascals). Similarly, t 5 0.000000003 s is a proofreader’s nightmare\ncompared to the equivalent t 5 3 ns (nanoseconds). Such prefi xes are common and\nconvenient, in both the SI and BG systems. A complete list is given in Table 1.3.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 29, "text": "14 Chapter 1 Introduction\nEXAMPLE 1.4\nIn 1890 Robert Manning, an Irish engineer, proposed the following empirical formula for\nthe average velocity V in uniform fl ow due to gravity down an open channel (BG units):\n1.49\nV5 R2/3S1/2 (1)\nn\nwhere R 5 hydraulic radius of channel (Chaps. 6 and 10)\nS 5 channel slope (tangent of angle that bottom makes with horizontal)\nn 5 Manning’s roughness factor (Chap. 10)\nand n is a constant for a given surface condition for the walls and bottom of the channel.\n( a) Is Manning’s formula dimensionally consistent? ( b) Equation (1) is commonly taken to\nbe valid in BG units with n taken as dimensionless. Rewrite it in SI form.\nSolution\n• Assumption: The channel slope S is the tangent of an angle and is thus a dimensionless\nratio with the dimensional notation {1}—that is, not containing M , L , or T .\n• Approach (a): Rewrite the dimensions of each term in Manning’s equation, using\nbrackets {}:\n1.49 L 1.49\n5V65 e f5R2/36 5S1/26 or e f 5 e f5L2/36516\nn T n\nThis formula is incompatible unless {1.49/n } 5 { L 1/3 / T }. If n is dimensionless (and\nit is never listed with units in textbooks), the number 1.49 must carry the dimensions of\n{ L1 /3 / T }. Ans. ( a )\n• Comment (a): Formulas whose numerical coeffi cients have units can be disastrous for\nengineers working in a different system or another fl uid. Manning’s formula, though\npopular, is inconsistent both dimensionally and physically and is valid only for water fl ow\nwith certain wall roughnesses. The effects of water viscosity and density are hidden in\nthe numerical value 1.49.\n• Approach (b): Part ( a ) showed that 1.49 has dimensions. If the formula is valid in BG\nunits, then it must equal 1.49 ft1 /3 /s. By using the SI conversion for length, we obtain\n(1.49 ft1/3/s)(0.3048 m/ft)1/351.00 m1/3/s\nTherefore, Manning’s inconsistent formula changes form when converted to the SI system:\n1.0\nSI units: V5 R2/3S1/2 A ns. ( b )\nn\nwith R in meters and V in meters per second.\n• Comment (b): Actually, we misled you: This is the way Manning, a metric user, fi rst\nproposed the formula. It was later converted to BG units. Such dimensionally inconsistent\nformulas are dangerous and should either be reanalyzed or treated as having very limited\napplication.", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}, {"page": 30, "text": "1.6 Thermodynamic Properties of a Fluid 15\n1.5 Properties of the In a given fl ow situation, the determination, by experiment or theory, of the properties\nVelocity Field of the fl uid as a function of position and time is considered to be the solution to the\nproblem. In almost all cases, the emphasis is on the space–time distribution of the\nfl uid properties. One rarely keeps track of the actual fate of the specifi c fl uid particles.\nThis treatment of properties as continuum-fi eld functions distinguishes fl uid mechan-\nics from solid mechanics, where we are more likely to be interested in the trajectories\nof individual particles or systems.\nT he Velocity Field Foremost among the properties of a fl ow is the velocity fi eld V ( x , y , z , t ). In fact,\ndetermining the velocity is often tantamount to solving a fl ow problem, since other\nproperties follow directly from the velocity fi eld. Chapter 2 is devoted to the calcula-\ntion of the pressure fi eld once the velocity fi eld is known. Books on heat transfer (for\nexample, Ref. 20) are largely devoted to fi nding the temperature fi eld from known\nvelocity fi elds.\nIn general, velocity is a vector function of position and time and thus has three\ncomponents u , v , and w , each a scalar fi eld in itself:\nV(x, y, z, t) 5iu(x, y, z, t) 1jv(x, y, z, t) 1kw(x, y, z, t) (1.4)\nT he use of u , v, and w instead of the more logical component notation V , V , and V\nx y z\nis the result of an almost unbreakable custom in fl uid mechanics. Much of this text-\nbook, especially Chaps. 4, 7, 8, and 9, is concerned with fi nding the distribution of\nthe velocity vector V for a variety of practical fl ows.\nT he Acceleration Field The acceleration vector, a 5 d V / dt, occurs in Newton’s law for a fl uid and thus is\nvery important. In order to follow a particle in the Eulerian frame of reference, the\nfi nal result for acceleration is nonlinear and quite complicated. Here we only give the\nformula:\ndV 0V 0V 0V 0V\na5 5 1u 1v 1w (1.5)\ndt 0t 0x 0y 0z\nwhere ( u, v, w ) are the velocity components from Eq. (1.4). We shall study this for-\nmula in detail in Chap. 4. The last three terms in Eq. (1.5) are nonlinear products and\ngreatly complicate the analysis of general fl uid motions, especially viscous fl ows.\n1 .6 Thermodynamic Properties While the velocity fi eld V is the most important fl uid property, it interacts closely\nof a Fluid with the thermodynamic properties of the fl uid. We have already introduced into the\ndiscussion the three most common such properties:\n1. Pressure p\n2. Density ρ\n3. Temperature T", "chapter": {"chapter_id": 1, "chapter_title": "Introduction"}}]