[{"page": 1, "text": "Lab 1: Setting-up the git environment\n• Watch these videos to have an idea about version control and Git\no Version Control 1\no Version Control 2\n• Create a GitHub account using your uwo email to get educational privileges.\n• Intro to GitHub\no Complete the https://github.com/skills/introduction-to-github\no Explore: https://skills.github.com/ You may find interesting tutorials there.\n• Download and install Git on your machine by following the instructions here: https://git-\nscm.com/book/en/v2/Getting-Started-Installing-Git\n• Configure your email and user name by running these commands through a command\nline terminal\no git config --global user.email \"you@example.com\"\no git config --global user.name \"YourName\"\n• Follow the steps below to work with the GitHub classroom assignment:\n1. Click on the link invitation link: https://classroom.github.com/a/DGvwIL_H\n2. Accept the invite and choose your student ID to link to your GitHub account\n3. A repository will be created under your account, click on that repository,\n4. Click on the ‘Code’ button, then copy the address to the remote repo."}, {"page": 2, "text": "5. Create a directory in your computer to be the place of all the labs (Make sure\nthere are no spaces in the path to that directory from beginning to the end)\n, and open a terminal inside the directory and clone that remote repo using the\ncommand ‘git clone <link to the remote repo>’\n6. Open the “hello.py” file in VSCode and add the line print(\"Hello, GitHub\nClassroom\") to it.\n▪ Please note that your changes are auto-graded so add the line exactly as\nit is (without extra or missing spaces or any other characters)\n7. Follow the instructions in this link to push your changes to the assignment's\nrepo: https://zeroesandones.medium.com/how-to-commit-and-push-your-\nchanges-to-your-github-repository-in-vscode-77a7a3d7dd02\n(Please note that the 'master' branch is now called 'main' so this is the name that\nyou'll see in the footer bar of your VSCode\n8. You don’t need to submit anything to the assignment on OWL, pushing your\ncode to the GitHub repo is the submission.\nPlease note that: The objective of this lab, is that you setup your environment to be able\nto work on the coming labs. If you don’t do the set-up properly now, you’ll have to do\ndouble the work in to be able to submit the next lab.\nDON’T change the code through the browser, if you have an issue with the proper\ncommit, talk with me or with the TA to figure out what the issue is,"}]